In [1]:
import pandas as pd

In [29]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
#unique values

In [31]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [32]:
df['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [33]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [34]:
len(df['col1'].unique())

4

In [35]:
len(df['col2'].unique())

3

In [36]:
len(df['col3'].unique())

4

In [37]:
df['col2'].nunique()

3

In [38]:
df['col1'].nunique()

4

In [39]:
df['col3'].nunique()

4

In [40]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [41]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [42]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [43]:
def times3(x):
    return x*3

In [44]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [45]:
df['col1'].apply(times3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [46]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [47]:
df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [48]:
df.drop('col1' , axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [49]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [50]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [55]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [57]:
df.sort_values(by='col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [58]:
df.sort_values(by='col1' , ascending=False)

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

In [60]:
df.sort_values(by='col3' , ascending =False)

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

In [61]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [62]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [65]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1